---
kind: property
id: P:Autodesk.Revit.DB.Visual.MetallicPaint.MetallicpaintPearlAmount
source: html/7d1b654e-e3fe-698f-cca5-ce9f58a9e37d.htm
---
# Autodesk.Revit.DB.Visual.MetallicPaint.MetallicpaintPearlAmount Property

The property labeled "Amount" from the "MetallicPaint" schema.

## Syntax (C#)
```csharp
public static string MetallicpaintPearlAmount { get; }
```

## Remarks
This property is of type "AssetPropertyDouble" within the range of "0, 1".